In [1]:
import pandas as pd

In [2]:
dict1 = {
    "names": ["Arpan","Rohit","Ibrahim"],
    "marks" : [90,21,43],
    "state" : ["West Bengal","Rajasthan","uttar pradesh"] 
}

In [4]:
df =pd.DataFrame(dict1)
df

     names  marks          state
0    Arpan     90    West Bengal
1    Rohit     21      Rajasthan
2  Ibrahim     43  uttar pradesh

In [ ]:
# df.to_csv("dataframeGeneratedfile.xls")
# df.to_csv("dataframeGeneratedfile_noIndex.xls", index=False)

In [8]:
df.describe()

           marks
count   3.000000
mean   51.333333
std    35.246749
min    21.000000
25%    32.000000
50%    43.000000
75%    66.500000
max    90.000000